In [23]:
import pandas as pd
import numpy as py

In [41]:
path = "Data/fish_name.xlsx"
fish_df = pd.read_excel(path)
fish_df = fish_df[['3A_CODE','Scientific_name','Family']]
fish_df.rename(columns = {'3A_CODE':'Species','Scientific_name':'scientific_name','Family':'family'}, inplace=True)
fish_df.head()

  Species       scientific_name           family
0     LAU    Petromyzon marinus  Petromyzontidae
1     LAR  Lampetra fluviatilis  Petromyzontidae
2     IDK    Lampetra aepyptera  Petromyzontidae
3     IDL      Lampetra ayresii  Petromyzontidae
4     IDN      Lampetra planeri  Petromyzontidae

In [36]:
path = "Data/fish_name.xlsx"
fish_name_df = pd.read_excel(path)
fish_name_df = fish_name_df[['3A_CODE','English_name']]
fish_name_df.rename(columns = {'3A_CODE':'Species','English_name':'name'}, inplace=True)
fish_name_df.head()

  Species                            name
0     LAU                     Sea lamprey
1     LAR                   River lamprey
2     IDK             Least brook lamprey
3     IDL  Western American river lamprey
4     IDN          European brook lamprey

In [25]:
cd_country = "data/country_codes.csv"
cd_country_df = pd.read_csv(cd_country)
cd_country_df.columns.tolist()
cd_country_df.columns = ['Code','Description',  'CodeType' , 'Deprecated',  'Created',  'Modified',  ' ']
cd_country_df.columns.tolist()

country_df = cd_country_df[['Code','Description']]
country_df.rename(columns={'Code':'Country'})
country_df.head()

  Code                                        Description
0  ALL   All countries used when reporting survey indices
1   BE                                            Belgium
2   BG                                           Bulgaria
3   CA                                             Canada
4   DE                                            Germany

In [47]:
path2 = "data/fish_catches.csv"
catches_df = pd.read_csv(path2)
catches_df = catches_df[['Species','Country','2006','2007','2008','2009','2010','2011','2012','2013','2014']]

In [48]:
df_unpivoted = catches_df.melt(id_vars=['Country','Species'], var_name='Year', value_name='TLW')

In [49]:
country_catch = df_unpivoted.groupby(["Country","Species","Year"]).sum()
country_catch.reset_index()
catches_df_all = pd.DataFrame(country_catch.reset_index())
catches_df_all.head()

  Country Species  Year     TLW
0      BE     ANF  2006  3579.0
1      BE     ANF  2007  4091.0
2      BE     ANF  2008  2894.0
3      BE     ANF  2009  2560.0
4      BE     ANF  2010  3093.0

In [51]:
unique_country = country_df['Code'].unique()
unique_country

array(['ALL', 'BE', 'BG', 'CA', 'DE', 'DK', 'EE', 'ES', 'FI', 'FO', 'FR',
       'GG', 'GL', 'IE', 'IM', 'IS', 'IT', 'JE', 'LT', 'LV', 'NL', 'NO',
       'OT1', 'OT2', 'OT3', 'PL', 'PT', 'RU', 'SE', 'UK', 'UKE', 'UKN',
       'UKS', 'US'], dtype=object)

In [52]:
catches_df = catches_df_all[catches_df_all['Country'].isin(unique_country)]

In [53]:
catches_df.head()

  Country Species  Year     TLW
0      BE     ANF  2006  3579.0
1      BE     ANF  2007  4091.0
2      BE     ANF  2008  2894.0
3      BE     ANF  2009  2560.0
4      BE     ANF  2010  3093.0

In [42]:
fish_df.to_csv('fish_final.csv', index=False)

In [32]:
country_df.to_csv('cd_country_final.csv',index=False)

In [54]:
catches_df.to_csv(r'catches_final.csv',index=False)

In [38]:
fish_name_df.to_csv('fish_name_final.csv', index=False)